In [2]:
import pandas as pd

In [2]:
series = pd.Series(["하나","둘","셋","넷","다섯",
                    "여섯","일곱","여덟","아홉","열"],
                   index = [_ for _ in range(1,11)])
series

1     하나
2      둘
3      셋
4      넷
5     다섯
6     여섯
7     일곱
8     여덟
9     아홉
10     열
dtype: object

In [3]:
# seres생성하기

s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052],
              index=["서울","부산","인천","대구"])

s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [4]:
# index 속성으로 접근
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [5]:
s.values

array([9904312, 3448737, 2890451, 2466052], dtype=int64)

In [6]:
s.name = '인구'
s.index.name = '도시'
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [7]:
d = {'a':1, 'b':2, 'c':3}
ser = pd.Series(data=d, index=['a','b','c'])
ser

a    1
b    2
c    3
dtype: int64

In [9]:
# dict의 key와 series 객체의 index를 다르게 설정
# 1. Series가 생성될 때 최초에 dictionary의 key를 index로 사용
d = {'a':1, 'b':2, 'c':3}
ser = pd.Series(data=d, index=['x','y','z'])
ser

x   NaN
y   NaN
z   NaN
dtype: float64

In [10]:
d = {'a':1,'b':2,'c':3}

ser = pd.Series(data=d , index=['a','b','c'])

ser

a    1
b    2
c    3
dtype: int64

In [11]:
ser.a,ser.b,ser.c

(1, 2, 3)

In [12]:
'서울' in s # 인덱스  레이블 중에 서울이 있는가

True

In [13]:
'대전' in s #인덱스 테이블 중에 대전이 있는가

False

In [14]:
for k,v in s.items():
    print(f"{k},{v}")

서울,9904312
부산,3448737
인천,2890451
대구,2466052

In [15]:
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [16]:
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [18]:
s[1],s["부산"]

(3448737, 3448737)

In [19]:
s[3],s["대구"]

(2466052, 2466052)

In [20]:
s[[0,3,1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [21]:
s[["서울","대구","부산"]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [22]:
s[1:3] # 두번쨰(1)부터 세번쨰(2)까지 (네번쨰(3) 미포함)

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [23]:
s["부산":"대구"] #부산에서 대구까지 (대구도 포함)

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [27]:
s2 = pd.Series({"서울":9631482,"부산":3393191,"인천":2632035,"대전":1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [28]:
ds = s - s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [29]:
ds.notnull() # series 내 값이 NaN인지 아닌지 True / False 값을 구하려면 notnull()메서드를 사용

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [30]:
# Series에서 NaN이 아닌 값 구하기
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [32]:
s # 2015년 도시별 인구

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [33]:
s2 # 2010년 도시별 인구

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [34]:
rs = (s - s2) / s2 * 100

rs = rs[rs.notnull()]

rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [35]:
# series 데이터 추가, 갱신, 삭제

rs #인구 증가율 (%)

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [36]:
rs["부산"] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [37]:
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [38]:
# 없는 index를 할당하면 값 추가
rs["대구"] = 1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [39]:
# 데이터 삭제
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [40]:
del rs["서울"]
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

In [41]:
# 연습문제
fin1 = {"카카오":60010,"삼성전자":61000,"LG전자":90000}
fin2_value = [60200,61200,200100]
fin2_index = ["카카오","삼성전자","네이버"]

In [44]:
ser_finance1 = pd.Series(fin1)
ser_finance1

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64

In [46]:
ser_finance2 = pd.Series(data=fin2_value, index=fin2_index)
ser_finance2

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [48]:
# NaN 형태 떄문에 float 형태로 변경됨
print(ser_finance1 - ser_finance2)
print(ser_finance1 + ser_finance2)
print(ser_finance1 * ser_finance2)
print(ser_finance1 / ser_finance2)

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64
LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64
LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64
LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [49]:
result = ser_finance1 - ser_finance2
result = result[result.notnull()]

In [50]:
result

삼성전자   -200.0
카카오    -190.0
dtype: float64

In [52]:
#DataFrame 생성
d = {'coll': [1,2], 'col2':[3,4]}

df = pd.DataFrame(data=d)
df

   coll  col2
0     1     3
1     2     4

In [3]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [4]:
df.dtypes

지역                object
2015               int64
2010               int64
2005               int64
2000               int64
2010-2015 증가율    float64
dtype: object

In [5]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [6]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [7]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [8]:
df.index.name = "도시"
df.columns.name = "특성"
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [69]:
m = {
    "루나":[10.70,5.29,4.69,4],
    "스카니아":[11.26,5.50,4.64,4.71],
    "엘리시움":[10.60,5.28,4.62,4.67],
    "크로아":[11.12,5.79,4.45,4.47],
    "직업":["아델","듀얼블레이더","패스파인더","소울마스터"]
}
colums = ["직업","루나","스카니아","엘리시움","크로아"]
index = ["전사","도적","궁수","기사단"]
maple = pd.DataFrame(m,index=index,columns=colums)
maple.index.name = "직업분류"
maple.columns.name = "서버"
maple

서버        직업     루나   스카니아   엘리시움    크로아
직업분류
전사        아델  10.70  11.26  10.60  11.12
도적    듀얼블레이더   5.29   5.50   5.28   5.79
궁수     패스파인더   4.69   4.64   4.62   4.45
기사단    소울마스터   4.00   4.71   4.67   4.47

In [9]:
df.T

도시                  서울       부산       인천       대구
특성
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

In [10]:
# "2010-2015증가율"이라는 이름의 열의 값을 갱신"
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [11]:
# "2005-2010 증가율"이라는 이름의 열 추가
df ["2005-2010 증가율"] = ((df["2010"] - df["2005"]) / df["2005"] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [12]:
# 하나의 column만 인덱싱하면 Series가 반환된다.
df["지역"]

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [13]:
# 2010이라는 column을 반환하면서 Series 자료형으로 변환
df["2010"]

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [14]:
type(df["2010"])

pandas.core.series.Series

In [15]:
# 여러 개의 columns을 인덱싱하면 부분적인 DataFrame이 반환된다.
df[["2010","2015"]]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [16]:
# 2010이라는 column을 반환하면서 DataFrame 자료형을 유지
df[["2010"]]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [17]:
type(df[["2010"]])

pandas.core.frame.DataFrame

In [19]:
df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2

NameError: name 'np' is not defined

In [18]:
# row 슬라이싱
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [20]:
df[:1] #df[:"서울"] -->문자는 포함, 숫자는 미포함

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34

In [21]:
df[1:2]

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           1.63           -3.4

In [22]:
df["부산":"부산"]

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           1.63           -3.4

In [24]:
df["2015"]["서울"]

9904312

In [25]:
type(df["2015"]["서울"])

numpy.int64

In [26]:
df["서울":"서울"]

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34

In [27]:
df["서울":"서울"]["2015"]

도시
서울    9904312
Name: 2015, dtype: int64

In [28]:
type(df["서울":"서울"]["2015"])

pandas.core.series.Series

In [69]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [70]:
#(1)
df["수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [71]:
#(2)
df[["국어","영어"]]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [72]:
#(3)
df ["평균"] = ((df["국어"] + df["수학"] + df["영어"]) / 3).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  40  70  46.67

In [75]:
#(4)
df.loc['방자','영어'] = 80
df ["평균"] = ((df["국어"] + df["수학"] + df["영어"]) / 3).round(2)
df

    국어  영어  수학     평균
춘향  80  90  90  86.67
몽룡  90  70  60  73.33
향단  70  60  80  70.00
방자  30  80  70  60.00

In [78]:
#(5)
df["춘향":"춘향"]

    국어  영어  수학     평균
춘향  80  90  90  86.67

In [83]:
#(6)
df.loc['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [84]:
df_1 = df.T
df_1["향단"]

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [111]:
import numpy as np
# 랜덤시드
np.random.seed(0)

In [112]:
values = np.random.randn(6,4)
values

array([[ 1.76405235,  0.40015721,  0.97873798,  2.2408932 ],
       [ 1.86755799, -0.97727788,  0.95008842, -0.15135721],
       [-0.10321885,  0.4105985 ,  0.14404357,  1.45427351],
       [ 0.76103773,  0.12167502,  0.44386323,  0.33367433],
       [ 1.49407907, -0.20515826,  0.3130677 , -0.85409574],
       [-2.55298982,  0.6536186 ,  0.8644362 , -0.74216502]])

In [114]:
columns = ["A","B","C","D"]
index = pd.date_range("20130226",periods=6)

df1 = pd.DataFrame(values, index = index, columns = columns)
df1

                   A         B         C         D
2013-02-26  1.764052  0.400157  0.978738  2.240893
2013-02-27  1.867558 -0.977278  0.950088 -0.151357
2013-02-28 -0.103219  0.410599  0.144044  1.454274
2013-03-01  0.761038  0.121675  0.443863  0.333674
2013-03-02  1.494079 -0.205158  0.313068 -0.854096
2013-03-03 -2.552990  0.653619  0.864436 -0.742165

In [ ]:
import numpy as np

class Calculater:
    def __init__(self):
        self.value = 0
        
    def add(self, *number):
        if len(number) > 0:
            num = np.array(number)
            self.value += np.sum(num)
        else :
            print("숫자를 입력하세요.")
            
    def minus(self, *number):
        if len(number) > 0 :
            num = np.array(number)
            self.value -= np.sum(num)
        else :
            print("숫자를 입력해주세요.")
            
    def show_value(self):
        print(f'현재 값은 {self.value}입니다.')

In [272]:
class Team:
    count = 0
    order = []
    
    def __init__(self,number,member={},name=None):
        self.number = number
        self.name = name
        self.__member  = str(member)
        
    def add_member(self,member):
        if str(member) in self.__member :
            print(f'{member}님은 이미 팀에 있습니다.')
        else :
            self.__member += member
            print(f'{member}님을 {self.number} 팀에 추가했습니다.')
            
    def rm_member(self,member):
        if str(member) in self.__member :
            del self._member[member]
            print(f'{member}님을 {self.number} 팀에서 삭제했습니다.')
        else :
            print(f'{member} 님은 해당 팀에 없습니다.')

In [273]:
t1 = Team(1)

In [274]:
t1.add_member("서영호")

서영호님을 1 팀에 추가했습니다.

In [275]:
t1.add_member("서영호")

서영호님은 이미 팀에 있습니다.

In [276]:
t1.rm_member("홍길동")

홍길동 님은 해당 팀에 없습니다.

In [277]:
t1.rm_member("서영호")

AttributeError: 'Team' object has no attribute '_member'

In [253]:
t1.add_member("서영호")

AttributeError: 'Team' object has no attribute '_Team__member'

In [284]:
class Team :
    """ 팀 객체를 만듭니다."""
    #클래스 생성
    count = 0 # Team 클래스로부터 초기화된 인스턴스 개수
    order = []
    
    def __init__(self,number,name=None, member=set()): ##default 값이 없으면 필수가 된다!
        self.number = number
        self.name = name
        self.__member = member
        Team.count += 1
        
    def add_member(self, name):
        # 해당 이름이 팀에 있을 경우
        if name in self.__member :
            print(f'{name} 님은 이미 팀에 있습니다.')
            return
        # 해당 이름이 팀에 없을 경우
        else :
            self.__member.add(name)
            print(f'{name} 님을 {self.number} 팀에 추가했습니다.')
    
    def rm_member(self,name):
         # 해당 이름이 팀에 있을 경우
        if name in self.__member :
            self.__member.discard(name) ##이름 삭제
            print(f'{name} 님을 {self.number} 팀에서 삭제했습니다.')
        # 해당 이름이 팀에 없을 경우
        else :
            print(f'{name} 님은 해당 팀에 없습니다.')
            
    def get_count(self):
        return self.count
    
    def get_order(self):
        return self.order
    
    def set_order(self,number):
        if number in self.order :
            self.order.remove(number)
        self.order.append(number)
        
    # 내장 함수(Built-in function) len() -->파이썬이 __len__(self)를 찾아서 실행
    def __len__(self):
        return len(self.__member)

In [285]:
t1 = Team(1) #Team 클래스로부터 인스턴스를 초기화한다. 초기화할 때 넣는 인자 값은 __init__(self,여기로 전달됨)
# 초기화될 때 1번이자 최초로 실행되는게 __init__(self) 이 특별 메서드이다.